app/controllers/proposals_controller.rb

  def index
    @proposals = IlpProposal.on_signature_time
		if @proposals.empty? then
---
SELECT * FROM "proposals"
SELECT count(*) AS count_all FROM "signatures" WHERE ("signatures".proposal_id = 1)

  def show
    @proposal = IlpProposal.find(params[:id])
---
SELECT * FROM "proposals" WHERE ("proposals"."id" = 1)